OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f071xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50000400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50000800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <description>General-purpose I/Os</description>
      <groupName>GPIO</groupName>
      <baseAddress>0x50001400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
    </peripheral>
    <peripheral>
      <name>I2C1</name>
      <description>Inter integrated circuit</description>
      <groupName>I2C</groupName>
      <baseAddress>0x40005400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>I2C1</name>
        <description>I2C1 global Interrupt</description>
        <value>23</value>
      </interrupt>
      <registers>
        <register>
          <name>CR1</name>
          <description>desc CR1</description>
          <addressOffset>0x0</addressOffset>
          <fields>
            <field>
              <name>PE</name>
              <description>desc PE</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>SMBUS</name>
              <description>desc SMBUS</description>
              <bitRange>[1:1]</bitRange>
            </field>
            <field>
              <name>SMBTYPE</name>
              <description>desc SMBTYPE</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>ENARP</name>
              <description>desc ENARP</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>ENPEC</name>
              <description>desc ENPEC</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>ENGC</name>
              <description>desc ENGC</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>NOSTRETCH</name>
              <description>desc NOSTRETCH</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>START</name>
              <description>desc START</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>STOP</name>
              <description>desc STOP</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ACK</name>
              <description>desc ACK</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>POS</name>
              <description>desc POS</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PEC</name>
              <description>desc PEC</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>ALERT</name>
              <description>desc ALERT</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>SWRST</name>
              <description>desc SWRST</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CR2</name>
          <description>desc CR2</description>
          <addressOffset>0x4</addressOffset>
          <fields>
            <field>
              <name>FREQ</name>
              <description>desc FREQ</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>ITERREN</name>
              <description>desc ITERREN</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ITEVTEN</name>
              <description>desc ITEVTEN</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>ITBUFEN</name>
              <description>desc ITBUFEN</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>DMAEN</name>
              <description>desc DMAEN</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>LAST</name>
              <description>desc LAST</description>
              <bitRange>[12:12]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR1</name>
          <description>desc OAR1</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>ADD0</name>
              <description>desc ADD0</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADD1_7</name>
              <description>desc ADD1_7</description>
              <bitRange>[7:1]</bitRange>
            </field>
            <field>
              <name>ADD8_9</name>
              <description>desc ADD8_9</description>
              <bitRange>[9:8]</bitRange>
            </field>
            <field>
              <name>ADDMODE</name>
              <description>desc ADDMODE</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>OAR2</name>
          <description>desc OAR2</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>ENDUAL</name>
              <description>desc ENDUAL</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>ADD2</name>
              <description>desc ADD2</description>
              <bitRange>[7:1]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DR</name>
          <description>desc DR</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>DR</name>
              <description>desc DR</description>
              <bitRange>[7:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <description>desc SR1</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>SB</name>
              <description>desc SB</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADDR</name>
              <description>desc ADDR</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BTF</name>
              <description>desc BTF</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ADD10</name>
              <description>desc ADD10</description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>desc STOPF</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXNE</name>
              <description>desc RXNE</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TXE</name>
              <description>desc TXE</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BERR</name>
              <description>desc BERR</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>ARLO</name>
              <description>desc ARLO</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>AF</name>
              <description>desc AF</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>OVR</name>
              <description>desc OVR</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>PECERR</name>
              <description>desc PECERR</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>TIMEOUT</name>
              <description>desc TIMEOUT</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>SMBALERT</name>
              <description>desc SMBALERT</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>SR2</name>
          <description>desc SR2</description>
          <addressOffset>0x18</addressOffset>
          <access>read-only</access>
          <fields>
            <field>
              <name>MSL</name>
              <description>desc MSL</description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY</name>
              <description>desc BUSY</description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>TRA</name>
              <description>desc TRA</description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GENCALL</name>
              <description>desc GENCALL</description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SMBDEFAULT</name>
              <description>desc SMBDEFAULT</description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SMBHOST</name>
              <description>desc SMBHOST</description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DUALF</name>
              <description>desc DUALF</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PEC</name>
              <description>desc PEC</description>
              <bitRange>[15:8]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCR</name>
          <description>desc CCR</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>CCR</name>
              <description>desc CCR</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>DUTY</name>
              <description>desc DUTY</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>FS</name>
              <description>desc FS</description>
              <bitRange>[15:15]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>TRISE</name>
          <description>desc TRISE</description>
          <addressOffset>0x20</addressOffset>
          <resetValue>0x2</resetValue>
          <fields>
            <field>
              <name>TRISE</name>
              <description>desc TRISE</description>
              <bitRange>[5:0]</bitRange>
            </field>
          </fields>
        </register>
