OpenPuya/PY32F0xx_Firmware/Packs/GCC/.pack/Puya/PY32F0xx_DFP/CMSIS/SVD/py32f071xx.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SPI1">
      <name>SPI2</name>
      <baseAddress>0x40003800</baseAddress>
      <interrupt>
        <name>SPI2</name>
        <description>SPI2 global Interrupt</description>
        <value>26</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SYSCFG</name>
      <description>desc SYSCFG</description>
      <groupName>SYSCFG</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x200</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CFGR1</name>
          <description>desc CFGR1</description>
          <addressOffset>0x0</addressOffset>
          <resetValue>0xFF0000</resetValue>
          <fields>
            <field>
              <name>MEM_MODE</name>
              <description>desc MEM_MODE</description>
              <bitRange>[1:0]</bitRange>
            </field>
            <field>
              <name>TIM1_IC1_SRC</name>
              <description>desc TIM1_IC1_SRC</description>
              <bitRange>[3:2]</bitRange>
            </field>
            <field>
              <name>TIM2_IC4_SRC</name>
              <description>desc TIM2_IC4_SRC</description>
              <bitRange>[5:4]</bitRange>
            </field>
            <field>
              <name>TIM3_IC1_SRC</name>
              <description>desc TIM3_IC1_SRC</description>
              <bitRange>[7:6]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM1</name>
              <description>desc ETR_SRC_TIM1</description>
              <bitRange>[10:8]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM2</name>
              <description>desc ETR_SRC_TIM2</description>
              <bitRange>[14:12]</bitRange>
            </field>
            <field>
              <name>ETR_SRC_TIM3</name>
              <description>desc ETR_SRC_TIM3</description>
              <bitRange>[18:16]</bitRange>
            </field>
            <field>
              <name>GPIO_AHB_SEL</name>
              <description>desc GPIO_AHB_SEL</description>
              <bitRange>[24:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR2</name>
          <description>desc CFGR2</description>
          <addressOffset>0x4</addressOffset>
          <resetValue>0x4</resetValue>
          <fields>
            <field>
              <name>LOCKUP_LOCK</name>
              <description>desc LOCKUP_LOCK</description>
              <bitRange>[0:0]</bitRange>
            </field>
            <field>
              <name>PVD_LOCK</name>
              <description>desc PVD_LOCK</description>
              <bitRange>[2:2]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM1</name>
              <description>desc COMP1_BRK_TIM1</description>
              <bitRange>[3:3]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM1</name>
              <description>desc COMP2_BRK_TIM1</description>
              <bitRange>[4:4]</bitRange>
            </field>
            <field>
              <name>COMP3_BRK_TIM1</name>
              <description>desc COMP3_BRK_TIM1</description>
              <bitRange>[5:5]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM15</name>
              <description>desc COMP1_BRK_TIM15</description>
              <bitRange>[6:6]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM15</name>
              <description>desc COMP2_BRK_TIM15</description>
              <bitRange>[7:7]</bitRange>
            </field>
            <field>
              <name>COMP3_BRK_TIM15</name>
              <description>desc COMP3_BRK_TIM15</description>
              <bitRange>[8:8]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM16</name>
              <description>desc COMP1_BRK_TIM16</description>
              <bitRange>[9:9]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM16</name>
              <description>desc COMP2_BRK_TIM16</description>
              <bitRange>[10:10]</bitRange>
            </field>
            <field>
              <name>COMP3_BRK_TIM16</name>
              <description>desc COMP3_BRK_TIM16</description>
              <bitRange>[11:11]</bitRange>
            </field>
            <field>
              <name>COMP1_BRK_TIM17</name>
              <description>desc COMP1_BRK_TIM17</description>
              <bitRange>[12:12]</bitRange>
            </field>
            <field>
              <name>COMP2_BRK_TIM17</name>
              <description>desc COMP2_BRK_TIM17</description>
              <bitRange>[13:13]</bitRange>
            </field>
            <field>
              <name>COMP3_BRK_TIM17</name>
              <description>desc COMP3_BRK_TIM17</description>
              <bitRange>[14:14]</bitRange>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM1</name>
              <description>desc COMP1_OCREF_CLR_TIM1</description>
              <bitRange>[15:15]</bitRange>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM2</name>
              <description>desc COMP1_OCREF_CLR_TIM2</description>
              <bitRange>[16:16]</bitRange>
            </field>
            <field>
              <name>COMP1_OCREF_CLR_TIM3</name>
              <description>desc COMP1_OCREF_CLR_TIM3</description>
              <bitRange>[17:17]</bitRange>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM1</name>
              <description>desc COMP2_OCREF_CLR_TIM1</description>
              <bitRange>[18:18]</bitRange>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM2</name>
              <description>desc COMP2_OCREF_CLR_TIM2</description>
              <bitRange>[19:19]</bitRange>
            </field>
            <field>
              <name>COMP2_OCREF_CLR_TIM3</name>
              <description>desc COMP2_OCREF_CLR_TIM3</description>
              <bitRange>[20:20]</bitRange>
            </field>
            <field>
              <name>COMP3_OCREF_CLR_TIM1</name>
              <description>desc COMP3_OCREF_CLR_TIM1</description>
              <bitRange>[21:21]</bitRange>
            </field>
            <field>
              <name>COMP3_OCREF_CLR_TIM2</name>
              <description>desc COMP3_OCREF_CLR_TIM2</description>
              <bitRange>[22:22]</bitRange>
            </field>
            <field>
              <name>COMP3_OCREF_CLR_TIM3</name>
              <description>desc COMP3_OCREF_CLR_TIM3</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR3</name>
          <description>desc CFGR3</description>
          <addressOffset>0x8</addressOffset>
          <fields>
            <field>
              <name>DMA1_MAP</name>
              <description>desc DMA1_MAP</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DMA2_MAP</name>
              <description>desc DMA2_MAP</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>DMA3_MAP</name>
              <description>desc DMA3_MAP</description>
              <bitRange>[21:16]</bitRange>
            </field>
            <field>
              <name>DMA4_MAP</name>
              <description>desc DMA4_MAP</description>
              <bitRange>[29:24]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>CFGR4</name>
          <description>desc CFGR4</description>
          <addressOffset>0xC</addressOffset>
          <fields>
            <field>
              <name>DMA5_MAP</name>
              <description>desc DMA5_MAP</description>
              <bitRange>[5:0]</bitRange>
            </field>
            <field>
              <name>DMA6_MAP</name>
              <description>desc DMA6_MAP</description>
              <bitRange>[13:8]</bitRange>
            </field>
            <field>
              <name>DMA7_MAP</name>
              <description>desc DMA7_MAP</description>
              <bitRange>[21:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PAENS</name>
          <description>desc PAENS</description>
          <addressOffset>0x10</addressOffset>
          <fields>
            <field>
              <name>PA_ENS</name>
              <description>desc PA_ENS</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PBENS</name>
          <description>desc PBENS</description>
          <addressOffset>0x14</addressOffset>
          <fields>
            <field>
              <name>PB_ENS</name>
              <description>desc PB_ENS</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PCENS</name>
          <description>desc PCENS</description>
          <addressOffset>0x18</addressOffset>
          <fields>
            <field>
              <name>PC_ENS</name>
              <description>desc PC_ENS</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PFENS</name>
          <description>desc PFENS</description>
          <addressOffset>0x1C</addressOffset>
          <fields>
            <field>
              <name>PF_ENS</name>
              <description>desc PF_ENS</description>
              <bitRange>[15:0]</bitRange>
            </field>
          </fields>
        </register>
